RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_tmr4.h
/**
 *******************************************************************************
 * @file  hc32f4a0_tmr4.h
 * @brief This file contains all the functions prototypes of the TMR4(Timer4)
 *        driver library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Hongjh          First version
   2020-07-15       Hongjh          Modify macro define for TMR4 SEVT match mask.
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32F4A0_TMR4_H__
#define __HC32F4A0_TMR4_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @addtogroup DDL_TMR4
 * @{
 */

#if (DDL_TMR4_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup TMR4_Global_Types TMR4 Global Types
 * @{
 */

/**
 * @brief TMR4 Counter(CNT) function initialization configuration
 */
typedef struct
{
    uint16_t u16CycleVal;       /*!< TMR4 count cycle value.
                                     This parameter can be a value of half-word */

    uint16_t u16CntMode;        /*!< TMR4 count mode.
                                     This parameter can be a value of @ref TMR4_CNT_Mode */

    uint16_t u16ClkSrc;         /*!< TMR4 count clock source.
                                     This parameter can be a value of @ref TMR4_CNT_Clock_Source */

    uint16_t u16PclkDiv;        /*!< TMR4 count PCLK clock division. The PCLK division function is valid when clock source is PCLK
                                     This parameter can be a value of @ref TMR4_CNT_PCLK_Division */

    uint16_t u16ZeroIntMask;    /*!< TMR4 count zero interrupt mask times.
                                     This parameter can be a value of @ref TMR4_CNT_Interrupt_Mask_Times */

    uint16_t u16PeakIntMask;    /*!< TMR4 count peak interrupt mask times.
                                     This parameter can be a value of @ref TMR4_CNT_Interrupt_Mask_Times */

    uint16_t u16BufState;       /*!< TMR4 count buffer state.
                                    This parameter can be a value of @ref TMR4_CNT_Buffer_State */
} stc_tmr4_cnt_init_t;

/**
 * @brief The configuration of OCO high channel OCMR field (OUH/OVH/OWH)
 */
typedef struct
{
    uint16_t OCFDCH : 1;    /*!< OCMRxh b0 High channel's OCF status when high channel match occurs at the condition of CNT is counting down
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_OCF_State */

    uint16_t OCFPKH : 1;    /*!< OCMRxh b1 High channel's OCF status when high channel match occurs at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_OCF_State */

    uint16_t OCFUCH : 1;    /*!< OCMRxh b2 High channel's OCF status when high channel match occurs at the condition of CNT is counting up
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_OCF_State */

    uint16_t OCFZRH : 1;    /*!< OCMRxh b3 High channel's OCF status when high channel match occurs at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_OCF_State */

    uint16_t OPDCH  : 2;    /*!< OCMRxh b5~b4 High channel's OP output status when high channel match occurs at the condition of CNT is counting down
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint16_t OPPKH  : 2;    /*!< OCMRxh b7~b6 High channel's OP output status when high channel match occurs at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint16_t OPUCH  : 2;    /*!< OCMRxh b9~b8 High channel's OP output status when high channel match occurs at the condition of CNT is counting up
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint16_t OPZRH  : 2;    /*!< OCMRxh b11~b10 High channel's OP output status when high channel match occurs at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint16_t OPNPKH : 2;    /*!< OCMRxh b13~b12 High channel's OP output status when high channel match doesn't occur at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint16_t OPNZRH : 2;    /*!< OCMRxh b15~b14 High channel's OP output status when high channel match doesn't occur at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */
} stc_tmr4_oco_ocmrh_field_t;

/**
 * @brief The configuration of OCO high channel(OUH/OVH/OWH)
 */
typedef struct
{
    union
    {
        uint16_t OCMRx;                     /*!< OCMRxH(x=U/V/W) register */

        stc_tmr4_oco_ocmrh_field_t OCMRx_f; /*!< OCMRxH(x=U/V/W) register struct field bit
                                                 This details refer @ref stc_tmr4_oco_ocmrh_field_t */
    };

