RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_tmr4.h
    uint16_t u16ExtendMatch;                /*!< Extend the match condition
                                                 This parameter can be a value of @ref TMR4_OCO_Extend_Match_Condtion */
} stc_oco_high_ch_compare_mode_t;

/**
 * @brief The configuration of OCO low channel OCMR field (OUL/OVL/OWL)
 */
typedef struct
{
    uint32_t OCFDCL  : 1;   /*!< OCMRxl b0 Low channel's OCF status when low channel match occurs at the condition of CNT is counting down
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_OCF_State */

    uint32_t OCFPKL  : 1;   /*!< OCMRxl b1 Low channel's OCF status when low channel match occurs at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_OCF_State */

    uint32_t OCFUCL  : 1;   /*!< OCMRxl b2 Low channel's OCF status when low channel match occurs at the condition of CNT is counting up
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_OCF_State */

    uint32_t OCFZRL  : 1;   /*!< OCMRxl b3 Low channel's OCF status when low channel match occurs at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_OCF_State */

    uint32_t OPDCL   : 2;   /*!< OCMRxl b5~b4 Low channel's OP output status when high channel not match and low channel match occurs at the condition of CNT is counting down
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint32_t OPPKL   : 2;   /*!< OCMRxl b7~b6 Low channel's OP output status when high channel not match and low channel match occurs at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint32_t OPUCL   : 2;   /*!< OCMRxl b9~b8 Low channel's OP output status when high channel not match and low channel match occurs at the condition of CNT is counting up
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint32_t OPZRL   : 2;   /*!< OCMRxl b11~b10 Low channel's OP output status when high channel not match and low channel match occurs at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint32_t OPNPKL  : 2;   /*!< OCMRxl b13~b12 Low channel's OP output status when high channel not match and low channel not match occurs at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint32_t OPNZRL  : 2;   /*!< OCMRxl b15~b14 Low channel's OP output status when high channel not match and low channel not match occurs at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPNDCL : 2;   /*!< OCMRxl b17~b16 Low channel's OP output status when high channel match and low channel not match occurs at the condition of CNT is coutning down
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPNUCL : 2;   /*!< OCMRxl b19~b18 Low channel's OP output status when high channel match and low channel not match occurs at the condition of CNT is counting up
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPDCL  : 2;   /*!< OCMRxl b21~b20 Low channel's OP output status when high channel and low channel match occurs at the condition of CNT is counting down
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPPKL  : 2;   /*!< OCMRxl b23~b22 Low channel's OP output status when high channel and low channel match occurs at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPUCL  : 2;   /*!< OCMRxl b25~b24 Low channel's OP output status when high channel and low channel match occurs at the condition of CNT is counting up
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPZRL  : 2;   /*!< OCMRxl b27~b26 Low channel's OP output status when high channel and low channel match occurs at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPNPKL : 2;   /*!< OCMRxl b29~b28 Low channel's OP output status when high channel match and low channel not match occurs at the condition of CNT count=Peak
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */

    uint32_t EOPNZRL : 2;   /*!< OCMRxl b31~b30 Low channel's OP output status when high channel match and low channel not match occurs at the condition of CNT count=0x0000
                                 This parameter can be a value of @ref TMR4_OCO_Cnt_Match_Output_Polarity */
} stc_tmr4_oco_ocmrl_field_t;

/**
 ** \brief The configuration of OCO low channel(OUL/OVL/OWL)
 */
typedef struct
{
    union
    {
        uint32_t OCMRx;                     /*!< OCMRxL(x=U/V/W) register */

        stc_tmr4_oco_ocmrl_field_t OCMRx_f; /*!< OCMRxL(x=U/V/W) register struct field bit
                                                 This details refer @ref stc_tmr4_oco_ocmrl_field_t */
    };

    uint16_t u16ExtendMatch;                /*!< Extend the match condition
                                                 This parameter can be a value of @ref TMR4_OCO_Extend_Match_Condtion */
} stc_oco_low_ch_compare_mode_t;

/**
 * @brief TMR4 Output Compare(OCO) initialization configuration
 */
typedef struct
{
    uint16_t u16CompareVal;         /*!< TMR4 OCO compare match value.
                                         This parameter can be a value of half-word */

