RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_tmr4.h
/** @defgroup TMR4_OCO_Channel TMR4 OCO Channel
 * @{
 */
#define TMR4_OCO_UH                             (0UL)   /*!< TMR4 OCO channel:UH */
#define TMR4_OCO_UL                             (1UL)   /*!< TMR4 OCO channel:UL */
#define TMR4_OCO_VH                             (2UL)   /*!< TMR4 OCO channel:VH */
#define TMR4_OCO_VL                             (3UL)   /*!< TMR4 OCO channel:VL */
#define TMR4_OCO_WH                             (4UL)   /*!< TMR4 OCO channel:WH */
#define TMR4_OCO_WL                             (5UL)   /*!< TMR4 OCO channel:WL */
/**
 * @}
 */

/**
 * @defgroup TMR4_OCO_State TMR4 OCO State
 * @{
 */
#define TMR4_OCO_DISABLE                        (0U)                /*!< Disable TMR4 OCO output */
#define TMR4_OCO_ENABLE                         (TMR4_OCSR_OCEH)    /*!< Enable TMR4 OCO output */
/**
 * @}
 */

/**
 * @defgroup TMR4_OCO_Invalid_Output_Polarity TMR4 OCO Invalid Output Polarity
 * @{
 */
#define TMR4_OCO_INVAILD_OP_LOW                 (0U)                /*!< TMR4 OCO Output low level when OCO is invalid */
#define TMR4_OCO_INVAILD_OP_HIGH                (TMR4_OCSR_OCPH)    /*!< TMR4 OCO Output high level when OCO is invalid */
/**
 * @}
 */

/** @defgroup TMR4_OCO_Extend_Match_Condtion TMR4 OCO Extend Match Condtion
 * @{
 */
#define TMR4_OCO_EXTEND_MATCH_DISABLE           (0U)                /*!< Disable TMR4 OCO extend match function */
#define TMR4_OCO_EXTEND_MATCH_ENABLE            (TMR4_OCER_MCECH)   /*!< Enable TMR4 OCO extend match function */
/**
 * @}
 */

/** @defgroup TMR4_OCO_OCCR_Link_Transfer TMR4 OCO OCCR Link Transfer
 * @{
 */
#define TMR4_OCO_OCCR_LINK_TRANSFER_DISABLE     (0U)                /*!< Disable the register OCCR buffer link transfer function */
#define TMR4_OCO_OCCR_LINK_TRANSFER_ENABLE      (TMR4_OCER_LMCH)    /*!< Register OCCR buffer transfer when the value is both 0 and CPSR and ZIC/PIC is 0 */
/**
 * @}
 */

/** @defgroup TMR4_OCO_OCCR_Buffer_Mode TMR4 OCO OCCR Buffer Mode
 * @{
 */
#define TMR4_OCO_OCCR_BUF_DISABLE               (0U)                    /*!< Disable the register OCCR buffer function */
#define TMR4_OCO_OCCR_BUF_CNT_ZERO              (TMR4_OCER_CHBUFEN_0)   /*!< Register OCCR buffer transfer when counter value is 0x0000 */
#define TMR4_OCO_OCCR_BUF_CNT_PEAK              (TMR4_OCER_CHBUFEN_1)   /*!< Register OCCR buffer transfer when counter value is CPSR */
#define TMR4_OCO_OCCR_BUF_CNT_ZERO_OR_PEAK      (TMR4_OCER_CHBUFEN)     /*!< Register OCCR buffer transfer when the value is both 0 and CPSR */
/**
 * @}
 */

/** @defgroup TMR4_OCO_OCMR_Link_Transfer TMR4 OCO OCMR Link Transfer
 * @{
 */
#define TMR4_OCO_OCMR_LINK_TRANSFER_DISABLE     (0x0000U)           /*!< Disable the register OCMR buffer link transfer function */
#define TMR4_OCO_OCMR_LINK_TRANSFER_ENABLE      (TMR4_OCER_LMMH)    /*!< Register OCMR buffer transfer when the value is both 0 and CPSR and ZIC/PIC is 0 */
/**
 * @}
 */

/** @defgroup TMR4_OCO_OCMR_Buffer_Mode TMR4 OCO OCMR Buffer Mode
 * @{
 */
#define TMR4_OCO_OCMR_BUF_DISABLE               (0U)                    /*!< Disable the register OCCR buffer function */
#define TMR4_OCO_OCMR_BUF_CNT_ZERO              (TMR4_OCER_MHBUFEN_0)   /*!< Register OCMR buffer transfer when counter value is 0x0000 */
#define TMR4_OCO_OCMR_BUF_CNT_PEAK              (TMR4_OCER_MHBUFEN_1)   /*!< Register OCMR buffer transfer when counter value is CPSR */
#define TMR4_OCO_OCMR_BUF_CNT_ZERO_OR_PEAK      (TMR4_OCER_MHBUFEN)     /*!< Register OCMR buffer transfer when the value is both 0 and CPSR */
/**
 * @}
 */

/** @defgroup TMR4_OCO_Cnt_Match_OCF_State TMR4 OCO Cnt Match OCF State
 * @{
 */
#define TMR4_OCO_OCF_HOLD                       (0U)                /*!< Hold OCF */
#define TMR4_OCO_OCF_SET                        (TMR4_OCMRH_OCFDCH) /*!< Set OCF */
/**
 * @}
 */

/** @defgroup TMR4_OCO_Cnt_Match_Output_Polarity TMR4 OCO Cnt Match Output Polarity
 * @{
 */
#define TMR4_OCO_OP_HOLD                        (0U)    /*!< Hold output when the TMR4 OCO count match */
#define TMR4_OCO_OP_HIGH                        (1U)    /*!< Output high when the TMR4 OCO count match */
#define TMR4_OCO_OP_LOW                         (2U)    /*!< Output low when the TMR4 OCO count match */
#define TMR4_OCO_OP_INVERT                      (3U)    /*!< Invert output when the TMR4 OCO count match */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @defgroup TMR4_PWM_Macros TMR4 PWM Macros
 * @{
 */

/** @defgroup TMR4_PWM_Channel TMR4 PWM Channel
 * @{
 */
#define TMR4_PWM_U                              (0UL)   /*!< TMR4 PWM couple channel: U */
#define TMR4_PWM_V                              (1UL)   /*!< TMR4 PWM couple channel: V */
#define TMR4_PWM_W                              (2UL)   /*!< TMR4 PWM couple channel: W */
/**
 * @}
 */

/** @defgroup TMR4_PWM_Port TMR4 PWM Port
 * @{
 */
#define TMR4_PWM_PORT_OUH                       (0UL)   /*!< TMR4 PWM port: TIM4_<t>_OUH */
#define TMR4_PWM_PORT_OUL                       (1UL)   /*!< TMR4 PWM port: TIM4_<t>_OUL */
#define TMR4_PWM_PORT_OVH                       (2UL)   /*!< TMR4 PWM port: TIM4_<t>_OVH */
#define TMR4_PWM_PORT_OVL                       (3UL)   /*!< TMR4 PWM port: TIM4_<t>_OVL */
#define TMR4_PWM_PORT_OWH                       (4UL)   /*!< TMR4 PWM port: TIM4_<t>_OWH */
#define TMR4_PWM_PORT_OWL                       (5UL)   /*!< TMR4 PWM port: TIM4_<t>_OWL */
/**
 * @}
 */

/** @defgroup TMR4_PWM_PCLK_Division TMR4 PWM PCLK Clock Division
 * @{
 */
#define TMR4_PWM_PCLK_DIV1                      (0U)                    /*!< PCLK     */
#define TMR4_PWM_PCLK_DIV2                      (TMR4_POCR_DIVCK_0)     /*!< PCLK/2   */
#define TMR4_PWM_PCLK_DIV4                      (TMR4_POCR_DIVCK_1)     /*!< PCLK/4   */
#define TMR4_PWM_PCLK_DIV8                      (TMR4_POCR_DIVCK_1 | \
                                                 TMR4_POCR_DIVCK_0)     /*!< PCLK/8   */
#define TMR4_PWM_PCLK_DIV16                     (TMR4_POCR_DIVCK_2)     /*!< PCLK/16  */
#define TMR4_PWM_PCLK_DIV32                     (TMR4_POCR_DIVCK_2 | \
                                                 TMR4_POCR_DIVCK_0)     /*!< PCLK/32  */
#define TMR4_PWM_PCLK_DIV64                     (TMR4_POCR_DIVCK_2 | \
                                                 TMR4_POCR_DIVCK_1)     /*!< PCLK/64  */
#define TMR4_PWM_PCLK_DIV128                    (TMR4_POCR_DIVCK_2 | \
                                                 TMR4_POCR_DIVCK_1 | \
                                                 TMR4_POCR_DIVCK_0)     /*!< PCLK/128 */
/**
 * @}
 */

/**
 * @defgroup TMR4_PWM_Mode TMR4 PWM Mode
 * @{
 */
#define TMR4_PWM_THROUGH_MODE                   (0U)                /*!< Through mode */
#define TMR4_PWM_DEAD_TIMER_MODE                (TMR4_POCR_PWMMD_0) /*!< Dead timer mode */
#define TMR4_PWM_DEAD_TIMER_FILTER_MODE         (TMR4_POCR_PWMMD_1) /*!< Dead timer filter mode */
/**
 * @}
 */

/**
 * @defgroup TMR4_PWM_Transform_OCO_Polarity TMR4 PWM Transform OCO Polarity
 * @{
 */
#define TMR4_PWM_OP_OXH_HOLD_OXL_HOLD           (0U)                /*!< Output PWML and PWMH signals without changing the level */
#define TMR4_PWM_OP_OXH_INVERT_OXL_INVERT       (TMR4_POCR_LVLS_0)  /*!< Output both PWML and PWMH signals reversed */
#define TMR4_PWM_OP_OXH_INVERT_OXL_HOLD         (TMR4_POCR_LVLS_1)  /*!< Output the PWMH signal reversed, outputs the PWML signal without changing the level. */
#define TMR4_PWM_OP_OXH_HOLD_OXL_INVERT         (TMR4_POCR_LVLS)    /*!< Output the PWMH signal without changing the level, Outputs the PWML signal reversed. */
/**
 * @}
 */

/**
 * @defgroup TMR4_PWM_Port_Output_Mode TMR4 PWM Port Mode
 * @{
 */
#define TMR4_PWM_PORT_OUTPUT_OSxy               (0UL)               /*!< TIM4_<t>_Oxy output polarity by specified OSxy */
#define TMR4_PWM_PORT_OUTPUT_NORMAL             (TMR4_PSCR_OEUH)    /*!< TIM4_<t>_Oxy output normal PWM */
/**
 * @}
 */

/**
 * @defgroup TMR4_PWM_EMB_Port_State TMR4 PWM EMB Port State
 * @{
 */
#define TMR4_PWM_EMB_PORT_OUTPUT_NORMAL         (0UL)               /*!< TIM4_<t>_Oxy output normal */
#define TMR4_PWM_EMB_PORT_OUTPUT_HIZ            (TMR4_PSCR_OSUH_0)  /*!< TIM4_<t>_Oxy output Hi-z */
#define TMR4_PWM_EMB_PORT_OUTPUT_LOW            (TMR4_PSCR_OSUH_1)  /*!< TIM4_<t>_Oxy output low level */
#define TMR4_PWM_EMB_PORT_OUTPUT_HIGH           (TMR4_PSCR_OSUH)    /*!< TIM4_<t>_Oxy output high level */
/**
 * @}
 */

/**
 * @defgroup TMR4_PWM_Port_Enable_Bit_Effective_Time TMR4 PWM Port Enable Bit Effective Time
 * @{
 */
#define TMR4_PWM_PORT_ENBIT_EFFECT_IMMEDIATE    (0UL)               /*!< TMR4 PWM Port Enable Bit Effective Time: immediate */
#define TMR4_PWM_PORT_ENBIT_EFFECT_CNTUVF       (TMR4_PSCR_ODT_1)   /*!< TMR4 PWM Port Enable Bit Effective Time: TMR4 counter underflow */
#define TMR4_PWM_PORT_ENBIT_EFFECT_CNTOVF       (TMR4_PSCR_ODT)     /*!< TMR4 PWM Port Enable Bit Effective Time: TMR4 counter overflow */
 /**
 * @}
 */

/**
 * @}
 */

/**
 * @defgroup TMR4_SEVT_Macros TMR4 Special Event Macros
 * @{
 */

/** @defgroup TMR4_SEVT_Channel TMR4 SEVT Channel
 * @{
 */
#define TMR4_SEVT_UH                            (0UL)   /*!< TMR4 SEVT channel:UH */
#define TMR4_SEVT_UL                            (1UL)   /*!< TMR4 SEVT channel:UL */
#define TMR4_SEVT_VH                            (2UL)   /*!< TMR4 SEVT channel:VH */
#define TMR4_SEVT_VL                            (3UL)   /*!< TMR4 SEVT channel:VL */
#define TMR4_SEVT_WH                            (4UL)   /*!< TMR4 SEVT channel:WH */
#define TMR4_SEVT_WL                            (5UL)   /*!< TMR4 SEVT channel:WL */
/**
 * @}
 */

/** @defgroup TMR4_SEVT_Link_Transfer TMR4 SEVT Link Transfer
 * @{
 */
#define TMR4_SEVT_LINK_TRANSFER_DISABLE         (0U)            /*!< Disable the SEVT Link Transfer function */
#define TMR4_SEVT_LINK_TRANSFER_ENABLE          (TMR4_SCSR_LMC) /*!< Enable the SEVT Link Transfer function */
/**
 * @}
 */

/** @defgroup TMR4_SEVT_Down_Selection TMR4 SEVT Down Selection
 * @{
 */
#define TMR4_SEVT_DOWN_DISABLE                  (0U)            /*!< Disable trigger signal when match with SCCR&SCMR and TMR4 CNT count zero */
#define TMR4_SEVT_DOWN_ENABLE                   (TMR4_SCSR_DEN) /*!< Enable trigger signal when match with SCCR&SCMR and TMR4 CNT count down */
/**
 * @}
 */

/** @defgroup TMR4_SEVT_Up_Selection TMR4 SEVT Up Selection
 * @{
 */
#define TMR4_SEVT_UP_DISABLE                    (0U)            /*!< Disable trigger signal when match with SCCR&SCMR and TMR4 CNT count up */
#define TMR4_SEVT_UP_ENABLE                     (TMR4_SCSR_UEN) /*!< Enable trigger signal when match with SCCR&SCMR and TMR4 CNT count up */
/**
 * @}
 */

/** @defgroup TMR4_SEVT_Peak_Selection TMR4 SEVT Peak Selection
 * @{
 */
#define TMR4_SEVT_PEAK_DISABLE                  (0U)            /*!< Disable trigger signal when match with SCCR&SCMR and TMR4 CNT count peak */
#define TMR4_SEVT_PEAK_ENABLE                   (TMR4_SCSR_PEN) /*!< Enable trigger signal when match with SCCR&SCMR and TMR4 CNT count peak */
/**
 * @}
 */

