RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_tmr4.h
/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup TMR4_Global_Functions
 * @{
 */

/**
 * @addtogroup TMR4_CNT_Global_Functions
 * @{
 */

/* Initialization and configuration TMR4 counter functions */
en_result_t TMR4_CNT_Init(M4_TMR4_TypeDef *TMR4x,
                                const stc_tmr4_cnt_init_t *pstcInit);
en_result_t TMR4_CNT_StructInit(stc_tmr4_cnt_init_t *pstcInit);
void TMR4_CNT_DeInit(M4_TMR4_TypeDef *TMR4x);
void TMR4_CNT_SetClock(M4_TMR4_TypeDef *TMR4x, uint16_t u16ClkSrc);
uint16_t TMR4_CNT_GetClock(const M4_TMR4_TypeDef *TMR4x);
void TMR4_CNT_SetPclkDiv(M4_TMR4_TypeDef *TMR4x, uint16_t u16Div);
uint16_t TMR4_CNT_GetPclkDiv(const M4_TMR4_TypeDef *TMR4x);
void TMR4_CNT_SetMode(M4_TMR4_TypeDef *TMR4x, uint16_t u16Mode);
uint16_t TMR4_CNT_GetMode(const M4_TMR4_TypeDef *TMR4x);
en_flag_status_t TMR4_CNT_GetStatus(const M4_TMR4_TypeDef *TMR4x, uint16_t u16Flag);
void TMR4_CNT_ClearStatus(M4_TMR4_TypeDef *TMR4x, uint16_t u16Flag);
void TMR4_CNT_IntCmd(M4_TMR4_TypeDef *TMR4x,
                            uint16_t u16IntSource,
                            en_functional_state_t enNewState);
void TMR4_CNT_Start(M4_TMR4_TypeDef *TMR4x);
void TMR4_CNT_Stop(M4_TMR4_TypeDef *TMR4x);
void TMR4_CNT_SetCycleVal(M4_TMR4_TypeDef *TMR4x, uint16_t u16CycleVal);
uint16_t TMR4_CNT_GetCycleVal(const M4_TMR4_TypeDef *TMR4x);
void TMR4_CNT_ClearCountVal(M4_TMR4_TypeDef *TMR4x);
void TMR4_CNT_SetCountVal(M4_TMR4_TypeDef *TMR4x, uint16_t u16CountVal);
uint16_t TMR4_CNT_GetCountVal(const M4_TMR4_TypeDef *TMR4x);
en_result_t TMR4_CNT_SetIntMaskTimes(M4_TMR4_TypeDef *TMR4x,
                                        uint16_t u16IntSource,
                                        uint16_t u16MaskTimes);
en_result_t TMR4_CNT_GetIntMaskTimes(const M4_TMR4_TypeDef *TMR4x,
                                            uint16_t u16IntSource,
                                            uint16_t *pu16MaskTimes);
en_result_t TMR4_CNT_GetIntMaskCurrentTimes(const M4_TMR4_TypeDef *TMR4x,
                                                    uint16_t u16IntSource,
                                                    uint16_t *pu16MaskTimes);
void TMR4_CNT_PortOutputDirSigCmd(M4_TMR4_TypeDef *TMR4x,
                                        en_functional_state_t enNewState);
/**
 * @}
 */

/**
 * @addtogroup TMR4_OCO_Global_Functions
 * @{
 */

/* Initialization and configuration TMR4 OCO functions */
en_result_t TMR4_OCO_Init(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                const stc_tmr4_oco_init_t *pstcInit);
en_result_t TMR4_OCO_StructInit(stc_tmr4_oco_init_t *pstcInit);
void TMR4_OCO_DeInit(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch);
void TMR4_OCO_SetOccrBufMode(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                uint16_t u16OccrBufMode);
uint16_t TMR4_OCO_GetOccrBufMode(const M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch);
void TMR4_OCO_SetOccrLinkTransfer(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t u16TransferState);
void TMR4_OCO_SetOcmrBufMode(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16OcmrBufMode);
uint16_t TMR4_OCO_GetOcmrBufMode(const M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch);
void TMR4_OCO_SetOcmrLinkTransfer(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t u16TransferState);
void TMR4_OCO_SetExtMatchCond(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16ExtMatch);
en_result_t TMR4_OCO_SetHighChCompareMode(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                const stc_oco_high_ch_compare_mode_t *pstcMode);
en_result_t TMR4_OCO_SetLowChCompareMode(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                const stc_oco_low_ch_compare_mode_t *pstcMode);
void TMR4_OCO_SetOutputCompare(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16OcoCmd);
void TMR4_OCO_IntCmd(M4_TMR4_TypeDef *TMR4x,
                            uint32_t u32Ch,
                            en_functional_state_t enNewState);
en_flag_status_t TMR4_OCO_GetStatus(const M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch);
void TMR4_OCO_ClearStatus(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch);
void TMR4_OCO_SetOcoInvalidOp(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16OutputPolarity);
uint16_t TMR4_OCO_GetOutputPolarity(const M4_TMR4_TypeDef *TMR4x,
                                                uint32_t u32Ch);
void TMR4_OCO_SetCompareVal(M4_TMR4_TypeDef *TMR4x,
                                    uint32_t u32Ch,
                                    uint16_t u16CompareVal);
uint16_t TMR4_OCO_GetCompareVal(const M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch);
/**
 * @}
 */

/**
 * @addtogroup TMR4_PWM_Global_Functions
 * @{
 */

/* Initialization and configuration TMR4 PWM functions */
en_result_t TMR4_PWM_Init(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                const stc_tmr4_pwm_init_t *pstcInit);
en_result_t TMR4_PWM_StructInit(stc_tmr4_pwm_init_t *pstcInit);
void TMR4_PWM_DeInit(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch);
void TMR4_PWM_SetPclkDiv(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                uint16_t u16Div);
uint16_t TMR4_PWM_GetPclkDiv(const M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch);
void TMR4_PWM_SetOcoPolarityTransform(M4_TMR4_TypeDef *TMR4x,
                                                uint32_t u32Ch,
                                                uint16_t u16OcoPolTransform);
uint16_t TMR4_PWM_GetOcoPolarityTransform(const M4_TMR4_TypeDef *TMR4x,
                                                    uint32_t u32Ch);
void TMR4_PWM_StartReloadTimer(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch);
void TMR4_PWM_StopReloadTimer(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch);
void TMR4_PWM_IntCmd(M4_TMR4_TypeDef *TMR4x,
                            uint32_t u32Ch,
                            en_functional_state_t enNewState);
en_flag_status_t TMR4_PWM_GetStatus(const M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch);
void TMR4_PWM_ClearStatus(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch);
void TMR4_PWM_SetDeadRegionValue(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t u16PDAR,
                                            uint16_t u16PDBR);
void TMR4_PWM_GetDeadRegionValue(const M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t *pu16PDAR,
                                            uint16_t *pu16PDBR);
void TMR4_PWM_SetFilterCountValue(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t u16Count);
void TMR4_PWM_AutoOutputCmd(M4_TMR4_TypeDef *TMR4x,
                                        en_functional_state_t enNewState);
void TMR4_PWM_MasterOutputCmd(M4_TMR4_TypeDef *TMR4x,
                                        en_functional_state_t enNewState);
void TMR4_PWM_PortOutputMode(M4_TMR4_TypeDef *TMR4x,
                                    uint32_t u32PwmPort,
                                    uint32_t u32Mode);
void TMR4_PWM_SetPortEnBitEffectTime(M4_TMR4_TypeDef *TMR4x,
                                                    uint32_t u32EffectTime);
uint32_t TMR4_PWM_GetPortEnBitEffectTime(const M4_TMR4_TypeDef *TMR4x);
void TMR4_PWM_EmbPwmPortOutputState(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32PwmPort,
                                            uint32_t u32State);
/**
 * @}
 */

/**
 * @addtogroup TMR4_SEVT_Global_Functions
 * @{
 */

