RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_tmr4.h
/* Initialization and configuration TMR4 SEVT functions */
en_result_t TMR4_SEVT_Init(M4_TMR4_TypeDef *TMR4x,
                                    uint32_t u32Ch,
                                    const stc_tmr4_sevt_init_t *pstcInit);
en_result_t TMR4_SEVT_StructInit(stc_tmr4_sevt_init_t *pstcInit);
void TMR4_SEVT_DeInit(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch);
void TMR4_SEVT_SetOutpuEvent(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16Event);
uint16_t TMR4_SEVT_GetOutpuEvent(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch);
void TMR4_SEVT_SetDelayObject(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16DelayObject);
uint16_t TMR4_SEVT_GetDelayObject(const M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch);
void TMR4_SEVT_SetCompareVal(M4_TMR4_TypeDef *TMR4x,
                            uint32_t u32Ch,
                            uint16_t u16CompareVal);
uint16_t TMR4_SEVT_GetCompareVal(const M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch);
void TMR4_SEVT_SetMaskTimes(M4_TMR4_TypeDef *TMR4x,
                                    uint32_t u32Ch,
                                    uint16_t u16MaskTimes);
uint16_t TMR4_SEVT_GetMaskTimes(const M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch);
void TMR4_SEVT_SetPortOutputEventSig(M4_TMR4_TypeDef *TMR4x,
                                            uint16_t u16EvtSignal);
uint16_t TMR4_SEVT_GetPortOutputEventSig(const M4_TMR4_TypeDef *TMR4x);
/**
 * @}
 */

/**
 * @}
 */

#endif /* DDL_TMR4_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32F4A0_TMR4_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
